{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
  "@odata.type": "#microsoft.graph.macOSCustomConfiguration",
  "@odata.id": "deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')",
  "@odata.editLink": "deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration",
  "id": "9935f672-aabe-454b-8e48-04399f354481",
  "lastModifiedDateTime@odata.type": "#DateTimeOffset",
  "lastModifiedDateTime": "2023-08-15T11:06:06.8918906Z",
  "roleScopeTagIds@odata.type": "#Collection(String)",
  "roleScopeTagIds": [
    "0"
  ],
  "supportsScopeTags": true,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "createdDateTime@odata.type": "#DateTimeOffset",
  "createdDateTime": "2023-08-13T21:01:01.2535711Z",
  "description": null,
  "displayName": "macOS - Login Items - Background Services for MDE",
  "version": 2,
  "payloadName": "background_services.mobileconfig",
  "payloadFileName": "background_services.mobileconfig",
  "payload@odata.type": "#Binary",
  "payload": "PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiPz4KPCFET0NUWVBFIHBsaXN0IFBVQkxJQyAiLS8vQXBwbGUvL0RURCBQTElTVCAxLjAvL0VOIiAiaHR0cDovL3d3dy5hcHBsZS5jb20vRFREcy9Qcm9wZXJ0eUxpc3QtMS4wLmR0ZCI+CjxwbGlzdCB2ZXJzaW9uPSIxIj4KPGRpY3Q+CjxrZXk+UGF5bG9hZFVVSUQ8L2tleT4KPHN0cmluZz42OUREOTgyNS0wNjdCLTRDNkMtOEI1NC1FREE4M0M3RjE3OUQ8L3N0cmluZz4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPkNvbmZpZ3VyYXRpb248L3N0cmluZz4KPGtleT5QYXlsb2FkT3JnYW5pemF0aW9uPC9rZXk+CjxzdHJpbmc+TWljcm9zb2Z0IENvcnBvcmF0aW9uPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz42OUREOTgyNS0wNjdCLTRDNkMtOEI1NC1FREE4M0M3RjE3OUQ8L3N0cmluZz4KPGtleT5QYXlsb2FkRGlzcGxheU5hbWU8L2tleT4KPHN0cmluZz5CYWNrZ3JvdW5kIFNlcnZpY2UgQ29uZmlndXJhdGlvbiBQcm9maWxlPC9zdHJpbmc+CjxrZXk+UGF5bG9hZERlc2NyaXB0aW9uPC9rZXk+CjxzdHJpbmcvPgo8a2V5PlBheWxvYWRWZXJzaW9uPC9rZXk+CjxpbnRlZ2VyPjE8L2ludGVnZXI+CjxrZXk+UGF5bG9hZEVuYWJsZWQ8L2tleT4KPHRydWUvPgo8a2V5PlBheWxvYWRSZW1vdmFsRGlzYWxsb3dlZDwva2V5Pgo8dHJ1ZS8+CjxrZXk+UGF5bG9hZFNjb3BlPC9rZXk+CjxzdHJpbmc+U3lzdGVtPC9zdHJpbmc+CjxrZXk+UGF5bG9hZENvbnRlbnQ8L2tleT4KPGFycmF5Pgo8ZGljdD4KPGtleT5QYXlsb2FkRGVzY3JpcHRpb248L2tleT4KPHN0cmluZz5CYWNrZ3JvdW5kIFNlcnZpY2UgTWFuYWdlbWVudCBmb3IgTWljcm9zb2Z0IERlZmVuZGVyPC9zdHJpbmc+CjxrZXk+UGF5bG9hZElkZW50aWZpZXI8L2tleT4KPHN0cmluZz40REI5NjI3Ni0yMzEwLTQ0QzItQUUxMS1DNkU3NjFGQjAzMDQucHJpdmFjeS4wNDEwMjQ4MS1DMUYxLTQ0RjItQjU0OC1FMEI1NTQ4OTA0OTM8L3N0cmluZz4KPGtleT5QYXlsb2FkVVVJRDwva2V5Pgo8c3RyaW5nPkE5QkY4RkE5LUNFQTMtNDJBMi1COEMxLUUxOTk4Qjg0Q0JCMDwvc3RyaW5nPgo8a2V5PlJ1bGVzPC9rZXk+CjxhcnJheT4KPGRpY3Q+CjxrZXk+UnVsZVR5cGU8L2tleT4KPHN0cmluZz5MYWJlbFByZWZpeDwvc3RyaW5nPgo8a2V5PlJ1bGVWYWx1ZTwva2V5Pgo8c3RyaW5nPmNvbS5taWNyb3NvZnQuZnJlc25vPC9zdHJpbmc+CjwvZGljdD4KPGRpY3Q+CjxrZXk+UnVsZVR5cGU8L2tleT4KPHN0cmluZz5MYWJlbFByZWZpeDwvc3RyaW5nPgo8a2V5PlJ1bGVWYWx1ZTwva2V5Pgo8c3RyaW5nPmNvbS5taWNyb3NvZnQuZGxwPC9zdHJpbmc+CjwvZGljdD4KPC9hcnJheT4KPGtleT5QYXlsb2FkVHlwZTwva2V5Pgo8c3RyaW5nPmNvbS5hcHBsZS5zZXJ2aWNlbWFuYWdlbWVudDwvc3RyaW5nPgo8a2V5PlBheWxvYWREaXNwbGF5TmFtZTwva2V5Pgo8c3RyaW5nPkJhY2tncm91bmQgU2VydmljZSBNYW5hZ2VtZW50IGZvciBNaWNyb3NvZnQgRGVmZW5kZXI8L3N0cmluZz4KPC9kaWN0Pgo8L2FycmF5Pgo8L2RpY3Q+CjwvcGxpc3Q+Cg==",
  "deploymentChannel@odata.type": "#microsoft.graph.appleDeploymentChannel",
  "deploymentChannel": "deviceChannel",
  "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/assignments",
  "assignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/assignments/$ref",
  "assignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/assignments",
  "deviceSettingStateSummaries@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/deviceSettingStateSummaries/$ref",
  "deviceSettingStateSummaries@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/deviceSettingStateSummaries",
  "deviceStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/deviceStatuses/$ref",
  "deviceStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/deviceStatuses",
  "deviceStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/deviceStatusOverview/$ref",
  "deviceStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/deviceStatusOverview",
  "groupAssignments@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/groupAssignments/$ref",
  "groupAssignments@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/groupAssignments",
  "userStatuses@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/userStatuses/$ref",
  "userStatuses@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/userStatuses",
  "userStatusOverview@odata.associationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/userStatusOverview/$ref",
  "userStatusOverview@odata.navigationLink": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.macOSCustomConfiguration/userStatusOverview",
  "#microsoft.graph.assign": {
    "title": "microsoft.graph.assign",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
  },
  "#microsoft.graph.assignedAccessMultiModeProfiles": {
    "title": "microsoft.graph.assignedAccessMultiModeProfiles",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
  },
  "#microsoft.graph.windowsPrivacyAccessControls": {
    "title": "microsoft.graph.windowsPrivacyAccessControls",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
  },
  "#microsoft.graph.getOmaSettingPlainTextValue": {
    "title": "microsoft.graph.getOmaSettingPlainTextValue",
    "target": "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations('9935f672-aabe-454b-8e48-04399f354481')/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
  }
}
